tiborsimon/embedded-tdd-headers/pic/pic18/pic18lf2450_tdd.h
#define TXD8                          522
#define TX9D1                         523
#define TX9D                          524
#define TRMT                          525
#define TRMT1                         526
#define BRGH1                         527
#define BRGH                          528
#define SENDB1                        529
#define SENDB                         530
#define SYNC                          531
#define SYNC1                         532
#define TXEN1                         533
#define TXEN                          534
#define TX91                          535
#define TX8_9                         536
#define TX9                           537
#define CSRC1                         538
#define CSRC                          539
#define BAUDCON                       540
#define ABDEN                         541
#define W4E                           542
#define WUE                           543
#define BRG16                         544
#define TXCKP                         545
#define SCKP                          546
#define RXCKP                         547
#define RXDTP                         548
#define RCMT                          549
#define RCIDL                         550
#define ABDOVF                        551
#define CCP1CON                       552
#define CCP1M0                        553
#define CCP1M                         554
#define CCP1M1                        555
#define CCP1M2                        556
#define CCP1M3                        557
#define DC1B                          558
#define DC1B0                         559
#define DC1B1                         560
#define ADCON2                        561
#define ADCS0                         562
#define ADCS                          563
#define ADCS1                         564
#define ADCS2                         565
#define ACQT0                         566
#define ACQT                          567
#define ACQT1                         568
#define ACQT2                         569
#define ADFM                          570
#define ADCON1                        571
#define PCFG0                         572
#define PCFG                          573
#define PCFG1                         574
#define PCFG2                         575
#define CHSN3                         576
#define PCFG3                         577
#define VCFG                          578
#define VCFG0                         579
#define VCFG01                        580
#define VCFG11                        581
#define VCFG1                         582
#define ADCON0                        583
#define ADON                          584
#define nDONE                         585
#define GO_nDONE                      586
#define NOT_DONE                      587
#define GODONE                        588
#define GO_DONE                       589
#define DONE                          590
#define GO_NOT_DONE                   591
#define GO                            592
#define CHS0                          593
#define CHS                           594
#define CHS1                          595
#define CHS2                          596
#define CHS3                          597
#define T2CON                         598
#define T2CKPS0                       599
#define T2CKPS                        600
#define T2CKPS1                       601
#define TMR2ON                        602
#define T2OUTPS0                      603
#define T2OUTPS                       604
#define T2OUTPS1                      605
#define T2OUTPS2                      606
#define T2OUTPS3                      607
#define PR2                           608
#define WM0                           609
#define WM1                           610
#define WAIT0                         611
#define WAIT1                         612
#define EBDIS                         613
#define T1CON                         614
#define TMR1ON                        615
#define TMR1CS                        616
#define NOT_T1SYNC                    617
#define T1SYNC                        618
#define nT1SYNC                       619
#define T1OSCEN                       620
#define SOSCEN                        621
#define T1CKPS0                       622
#define T1CKPS                        623
#define T1CKPS1                       624
#define T1RUN                         625
#define RD16                          626
#define T1RD16                        627
#define RCON                          628
#define BOR                           629
#define NOT_BOR                       630
#define nBOR                          631
#define POR                           632
#define nPOR                          633
#define NOT_POR                       634
#define PD                            635
#define nPD                           636
#define NOT_PD                        637
#define NOT_TO                        638
#define nTO                           639
#define TO                            640
#define nRI                           641
#define NOT_RI                        642
#define RI                            643
#define SBOREN                        644
#define nIPEN                         645
#define IPEN                          646
#define NOT_IPEN                      647
#define WDTCON                        648
#define SWDTE                         649
#define SWDTEN                        650
#define HLVDCON                       651
#define HLVDL                         652
#define HLVDL0                        653
#define LVV0                          654
#define LVDL0                         655
#define HLVDL1                        656
#define LVDL1                         657
#define LVV1                          658
#define HLVDL2                        659
#define LVV2                          660
#define LVDL2                         661
#define HLVDL3                        662
#define LVV3                          663
#define LVDL3                         664
#define HLVDEN                        665
#define LVDEN                         666
#define BGST                          667
#define IRVST                         668
#define IVRST                         669
#define VDIRMAG                       670
#define OSCCON                        671
#define SCS0                          672
#define SCS                           673
#define SCS1                          674
#define OSTS                          675
#define IDLEN                         676
#define T0CON                         677
#define T0PS                          678
#define T0PS0                         679
#define T0PS1                         680
#define T0PS2                         681
#define PSA                           682
#define T0SE                          683
#define T0CS                          684
#define T08BIT                        685
#define TMR0ON                        686
#define STATUS                        687
#define C                             688
#define CARRY                         689
#define DC                            690
#define ZERO                          691
#define Z                             692
#define OV                            693
#define OVERFLOW                      694
#define N                             695
#define NEGATIVE                      696
#define INTCON3                       697
#define INT1IF                        698
#define INT1F                         699
#define INT2IF                        700
#define INT2F                         701
#define INT1E                         702
#define INT1IE                        703
#define INT2IE                        704
#define INT2E                         705
#define INT1P                         706
#define INT1IP                        707
#define INT2IP                        708
#define INT2P                         709
#define INTCON2                       710
#define RBIP                          711
#define TMR0IP                        712
#define T0IP                          713
#define INTEDG2                       714
#define INTEDG1                       715
#define INTEDG0                       716
#define RBPU                          717
#define NOT_RBPU                      718
#define nRBPU                         719
#define INTCON                        720
#define RBIF                          721
#define INT0F                         722
#define INT0IF                        723
#define T0IF                          724
#define TMR0IF                        725
#define RBIE                          726
#define INT0E                         727
#define INT0IE                        728
#define T0IE                          729
#define TMR0IE                        730
#define PEIE                          731
#define PEIE_GIEL                     732
#define GIEL                          733
#define GIE_GIEH                      734
#define GIE                           735
#define GIEH                          736
#define STKPTR0                       737
#define STKPTR                        738
#define STKPTR1                       739
#define STKPTR2                       740
#define STKPTR3                       741
#define STKPTR4                       742
#define STKUNF                        743
#define STKOVF                        744
#define STKFUL                        745

#endif // _PIC18LF2450_H_
